// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// let time = prompt("Введіть хвилину");
//
// if (time <= 14){
//     console.log(`ПершаЧетверть`)
// }
// else if (time <= 30){
//     console.log("ДругаЧетверть")
// }
// else if (time <= 45) {
//     console.log("ТретяЧетверть")
// }
// else if (time <= 59){
//     console.log("ЧетвертаЧетверть")
// }else {
//     console.log("НЕТІ ЦИФЕРКИ ПИШЕШ ДРУГ)")
//     alert("НЕТІ ЦИФЕРКИ ПИШЕШ ДРУГ)")
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('Введіть будьласка будь який день від 1 до 31');
// if (day <= 10){
//     console.log("Перша Декада")
// }
// else if (day <=20){
//     console.log("Друга Декада")
// }
// else if (day <=31){
//     console.log("Третя Декада")
// }else{
//     console.log("ВоуВоу в Місяці тільки 31 день")
//     alert("ВоуВоу в Місяці тільки 31 день")
// }








