// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// let time = prompt("Введіть хвилину");
//
// if (time <= 14){
//     console.log(`ПершаЧетверть`)
// }
// else if (time <= 30){
//     console.log("ДругаЧетверть")
// }
// else if (time <= 45) {
//     console.log("ТретяЧетверть")
// }
// else if (time <= 59){
//     console.log("ЧетвертаЧетверть")
// }else {
//     console.log("НЕТІ ЦИФЕРКИ ПИШЕШ ДРУГ)")
//     alert("НЕТІ ЦИФЕРКИ ПИШЕШ ДРУГ)")
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('Введіть будьласка будь який день від 1 до 31');
// if (day <= 10){
//     console.log("Перша Декада")
// }
// else if (day <=20){
//     console.log("Друга Декада")
// }
// else if (day <=31){
//     console.log("Третя Декада")
// }else{
//     console.log("ВоуВоу в Місяці тільки 31 день")
//     alert("ВоуВоу в Місяці тільки 31 день")
// }

// - У нас є змінна test яка дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = true;
// if (test !== true) {
//     console.log('Вірно')
// } else if (test === true) {
//     console.log('Не вірно')
// }
// let test1 = true;
// if (test1 === true) {
//     console.log('Вірно')
// } else if (test1 === true) {
//     console.log('Не вірно')
// }

// let test = confirm(`TRUE OR FALSE?`) ? true : false;
// console.log(test)

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = prompt("Введіть число");
// if (a != 0){
//     console.log("Вірно")
// }else {
//     console.log("НеВірно")
// }
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
// let days = prompt( "Введи день" );
// switch (days){
//     case "1" :
//         console.log("Понеділок: Поприбирати вдома")
//         break;
//     case "2":
//         console.log("Вівторок : Сходити до церкви.")
//         break;
//     case "3":
//         console.log("Середа : Чекати Четверг")
//         break;
//     case "4":
//         console.log("Четверг : Чекати Пятницю")
//         break;
//     case "5":
//         console.log("Пятниця : Чекати Субботу")
//         break;
//     case "6":
//         console.log("Суббота : Чекати Неділю")
//         break;
//     case "7":
//         console.log("Неділя : ВИХІДНИЙ")
//         break;
//     default :
//         console.log("ТИ ЩОТА ПУТАЄШ");
// }
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let namejs = prompt("Яка «офіційна» назва JavaScript")
// if (namejs === "ECMAScript" ){
//     alert("Правильно!");
// }else alert("Не знаєте? ECMAScript")















